In [3]:
import pandas as pd

In [5]:
df = pd.DataFrame({
    "Name": ["Braund, Mr. Owen Harris",  "Allen, Mr. William Henry"],
    "Age": [22, 35]
    })

In [6]:
df

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35

# sqlalchemy
https://www.sqlalchemy.org/  

```bash
pip install sqlalchemy  
```
https://www.fun-coding.org/mysql_advanced2.html

In [16]:
# engine = create_engine("mysql+pymysql://아이디:"+"암호"+"@mysql주소:포트/데이터베이스이름?charset=utf8", encoding='utf-8')

from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root"+"@localhost:3306/sample_db", encoding='utf-8')
conn = engine.connect()

In [17]:
df.to_sql(name='data', con=engine, if_exists='append', index=False)

In [19]:
df2 = pd.read_sql("SELECT * from data", con=engine)

In [20]:
df2

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2   Braund, Mr. Owen Harris   22
3  Allen, Mr. William Henry   35